gg# -*- coding: utf-8 -*-
"""27 - Подготовка к экзамену.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1Ofyht4HdnVHFmax1M6bPQ5he11BFV2fg

## Что вас ждет на экзамене

- Работа со списками, словарями
- Файлы, JSON, CSV
- Регулярные выражения
- Pandas
<hr>

### Задача 1

Сохранить себе проект pykili (https://github.com/pykili/pykili.github.io), найти все файлы формата .md и сформировать словарь, где ключ - название папки, а значение - лист файлов с форматом .md

hint: домашняя директория будет pykili.github.io, файл readme.md можно проигнорировать
"""

import os

dirs = {}
for dir in os.walk('pykili.github.io'):
    for file in os.listdir(dir[0]):
        if os.path.splitext(file)[1] == '.md':
            # dirs[dir[0]].setdefault([])
            dirs[dir[0]] = dirs.get(dir[0], list()) + [file]

print(dirs)






"""### Задача 2

Скачать файл https://drive.google.com/file/d/15FvspbVbu72Sa64am1mJ_3xueKiY0PVH/view?usp=sharing - рейтинг World Happiness Report 2021. Вам необходимо для каждой страны (Country name) создать отдельный файл, в котором будут находиться страны только этого региона и их данные
"""

import pandas as pd

df = pd.read_csv('WHR2021.csv')
for country in df['Country name'].unique():
    df[df['Country name'] == country].to_csv('countries/' + country + '.csv')








"""### Задача 3

Работаем с тем-же файлом. Выведите топ 10 с самым низким средним восприятием коррупции (Perceptions of corruption). Для этих 10 стран найдите страну с самым большим показателем Healthy life expectancy at birth. Постройте по этой стране линейный график данной величины
"""

import pandas as pd

df = pd.read_csv('WHR2021.csv')
df.head()

max = ('', 0)
for country in df.sort_values('Perceptions of corruption').drop_duplicates('Country name').head(10)['Country name']:
    print(country)
    print(df[df['Country name'] == country]['Healthy life expectancy at birth'].idxmax())
df[df['Country name'] == 'Hong Kong S.A.R. of China']
