from re import search, finditer, compile
from collections import Counter

exes = [  # как жизнь?
    'Вавилон(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ас*ур[а-я]{0,1}(?![а-яѣ])',

    # 'Ц[а-яѣ]*р[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ц[а-яѣ]*р(?=[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д[а-яѣ]{0,3}(?![а-яѣ]))',
    '(?<=р.)г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    'Рим(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'К[ыиеѣі]{1,2}в(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    # 'Нов[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Нов(?=[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д[а-яѣ]{0,3}(?![а-яѣ]))',
    '(?<=в.)г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',


    'Смол[а-яѣ]*н[а-яѣ]*с(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ростов(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ладо(?=(г|з)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Избор[а-яѣ]*с(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Пол[а-яѣ]*т[а-яѣ]*с(?=(ц|к)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Селун(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Переяславл(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Искорост[а-яѣ]*н(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Чер[а-яѣ]*н[а-яѣ]*г(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Плес[а-яѣ]*к[а-яѣ]*в(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    # 'Б[а-яѣ]*л[а-яѣ]* ?В[а-яѣ]*ж(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Б[а-яѣ]*л(?=[а-яѣ]* ?Веж[а-яѣ]{0,3}(?![а-яѣ]))',
    '(?<=л.) ?Веж(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    'Дер[а-яѣ]*ст[а-яѣ]*р(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'В[а-яѣ]*руч(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Родн(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Перемышл(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Червен(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Содом(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Гомор(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Вефил(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ендан(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    '(Ие|Е)рус[а-яѣ]*м(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Кон*ст[а-яѣ]*т[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Кор[а-яѣ]*сун(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Туров(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Муром(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'В[а-яѣ]*л[а-яѣ]*д[а-яѣ]*м[а-яѣ]*р(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Т[а-яѣ]*м[а-яѣ]*торокан(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    # 'Б[а-яѣ]*л[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Б[а-яѣ]*л(?=[а-яѣ]*г[а-яѣ]*р[а-яѣ]*д[а-яѣ]{0,3}(?![а-яѣ]))',
    '(?<=л.)г[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',

    'Вышег[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Берест(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Суждал(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    '(Гу|Гю|Ю)р[а-яѣ]*в(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Люб[а-яѣ]*ч(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'М[еѣ]*н[а-яѣ]*с(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Ръ*ш(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Дорогобуж(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Дрью[а-яѣ]*(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Пѣсоч[а-яѣ]*н(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Переволо(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Прилу(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Трепол(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Тор[а-яѣ]*ч[а-яѣ]*(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Рязан(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Теребовл(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Звениг[а-яѣ]*р[а-яѣ]*д(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Г[а-яѣ]*р[а-яѣ]*д[а-яѣ]*(?=(ц|ч)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Шепол(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Буж[а-яѣ]*с[а-яѣ]*(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Турийс[а-яѣ]*(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Лу(ч|тц)[а-яѣ]*(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Дубен(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Черторыес(?=(к|ц)[а-яѣ]{0,3}(?![а-яѣ]))',
    'Луб[а-яѣ]*н(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Прип[а-яѣ]*т(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Хорол(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Сугров(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Шарукан(?=[а-яѣ]{0,3}(?![а-яѣ]))',
    'Балин(?=[а-яѣ]{0,3}(?![а-яѣ]))',
]

with open('povest_cleansed.txt', encoding='utf-8') as f:
    text = f.read()

cities = {}
for ex in exes:
    patt = compile(ex)
    var = [i.group() for i in patt.finditer(text)]
    md = max(set(var), key=var.count)
    text = patt.sub(md, text)


with open('povest_regular.txt', 'w', encoding='utf-8') as f:
    f.write(text)
